# SQL Notes

SELECT year,
       month,
       west
  FROM tutorial.us_housing_units

### Change the title of a column in a table, must be in double quotes

In [ ]:
SELECT west AS "West Region"
  FROM tutorial.us_housing_units

### Limit the rows returned using LIMIT

In [ ]:
SELECT *
  FROM tutorial.us_housing_units
 LIMIT 100

### Filtering using WHERE and a column name. Relationships between values in a row will be preserved (rows will be cut if they don't fit the WHERE criteria).

In [ ]:
SELECT *
  FROM tutorial.us_housing_units
 WHERE month = 1

In [ ]:
Equal to	=
Not equal to	<> or !=
Greater than	>
Less than	<
Greater than or equal to	>=
Less than or equal to	<=

In [ ]:
SELECT *
  FROM tutorial.us_housing_units
 WHERE west > 30

### If using an operator with values that are non-numeric use single quotes. Single quotes reference column values.

In [ ]:
SELECT *
  FROM tutorial.us_housing_units
 WHERE month_name != 'January'

### Numerical operators such as the below only work across columns

In [ ]:
SELECT year,
       month,
       west,
       south,
       west + south AS south_plus_west
  FROM tutorial.us_housing_units

In [ ]:
SELECT year,
       month,
       west,
       south,
       (west + south)/2 AS south_west_avg
  FROM tutorial.us_housing_units

In [ ]:
SELECT year,
       month,
       west,
       south,
       midwest,
       northeast,
       west + south + midwest +northeast AS usa_total
  FROM tutorial.us_housing_units

In [ ]:
SELECT (south / (south + west + midwest + northeast)) * 100 AS "South Average",
       (west / (south + west + midwest + northeast)) * 100 AS "West Average",
       (midwest / (south + west + midwest + northeast)) * 100 AS "Midwest Average",
       (northeast / (south + west + midwest + northeast)) * 100 AS "Northeast Average"
  FROM tutorial.us_housing_units
  WHERE year >= 2000

In [ ]:

    LIKE allows you to match similar values, instead of exact values.
    
    IN allows you to specify a list of values you’d like to include.
    
    BETWEEN allows you to select only rows within a certain range.
    
    IS NULL allows you to select rows that contain no data in a given column.
    
    AND allows you to select only rows that satisfy two conditions.
    
    OR allows you to select rows that satisfy either of two conditions.
    
    NOT allows you to select rows that do not match a certain condition.

### include rows for which "group" starts with “Snoop” and is followed by any number and selection of characters.

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE "group" LIKE 'Snoop%'

Note: "group" appears in quotations above because GROUP is actually the name of a function in SQL. The double quotes (as opposed to single: ') are a way of indicating that you are referring to the column name "group", not the SQL function. In general, putting double quotes around a word or phrase will indicate that you are referring to that column name.

To ignore case when you’re matching values, you can use the ILIKE command:

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE "group" ILIKE 'snoop%'

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE artist ILIKE 'dr_ke'

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE "group" ILIKE '%Ludacris%'

### IN

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year_rank IN (1, 2, 3)

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE artist IN ('Taylor Swift', 'Usher', 'Ludacris')

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE artist IN ('Hammer', 'M.C. Hammer', 'Elvis Presley')

### Between

BETWEEN is a logical operator in SQL that allows you to select only rows that are within a specific range. It has to be paired with the AND operator, which you’ll learn about in a later lesson. Here’s what BETWEEN looks like on a Billboard Music Charts dataset:

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year_rank BETWEEN 5 AND 10

BETWEEN includes the range bounds (in this case, 5 and 10) that you specify in the query, in addition to the values between them.

You can select rows that contain no data in a given column by using 
### IS NULL.

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE song_name IS NULL

### AND is a logical operator in SQL that allows you to select only rows that satisfy two conditions.

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2012 AND year_rank <= 10

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2012
   AND year_rank <= 10
   AND "group" ILIKE '%feat%'

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE "group" ILIKE '%Ludacris%'
   AND year_rank <= 10

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year_rank = 1
   AND year IN (1990, 2000, 2010)

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year BETWEEN 1960 AND 1969
 AND song_name ILIKE '%love%'

### OR is a logical operator in SQL that allows you to select rows that satisfy either of two conditions

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year_rank = 5 OR artist = 'Gotye'

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
   AND ("group" ILIKE '%macklemore%' OR "group" ILIKE '%timberlake%')

### NOT is a logical operator in SQL that you can put before any conditional statement to select rows for which that statement is false.

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
   AND year_rank NOT BETWEEN 2 AND 3

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
   AND "group" NOT ILIKE '%macklemore%'

### NOT is also frequently used to identify non-null rows, but the syntax is somewhat special—you need to include IS beforehand. Here’s how that looks:

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
   AND artist IS NOT NULL

### The ORDER BY clause allows you to reorder your results based on the data in one or more columns. First, take a look at how the table is ordered by default:

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 ORDER BY artist

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
 ORDER BY year_rank

In [ ]:
SELECT *
  FROM tutorial.billboard_top_100_year_end
 WHERE year = 2013
 ORDER BY year_rank DESC